### DataFrame에서 행/열 삭제

In [14]:
# 모듈로딩
import pandas as pd

In [20]:
# 데이터 준비
data={'name':['홍길동','마징가','원더우면'],
      'job': ['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100,200,300],
      'height':[180,300,200]}

In [22]:
# DF으로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우면  영웅      여  300     200

- [실습] 1번행 삭제 : 변수명.drop()메서드

In [23]:
## 1개 행 삭제 -> 기본값 : 행 삭제, 복사본 사용, 원본 변경 X
dataDF.drop(1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우면  영웅      여  300     200

In [24]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우면  영웅      여  300     200

In [25]:
## 2개 행 삭제 -> 기본값 : 행 삭제, 복사본 사용, 원본 변경 X
dataDF.drop([0,2])

  name job gender  age  height
1  마징가  로봇      남  200     300

- [실습] 열/컬럼 삭제 : 변수명.drop( ,axis=1 또는 axis='columns') 메서드
    - 삭제 방향 즉, 기준을 열로 설정 필수
    - [실습] 행 삭제 : 변수명.drop() 메서드
    * 변수명.drop(labels, axis=0) : axis의 설정 값에 따라 행 또는 열 삭제 진행
    * 변수명.drop(index): 지정된 인덱스의 행 삭제

In [26]:
## age 컬럼을 삭제

dataDF.drop('age',axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우면  영웅      여     200

In [27]:
dataDF.drop('age',axis='columns')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우면  영웅      여     200

In [29]:
# gender, height 컬럼 삭제
dataDF.drop(['gender','height'],axis=1)

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우면  영웅  300

In [30]:
#dataDF.drop([0,1],axis=1])

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (3797485591.py, line 1)

In [31]:
dataDF.drop(dataDF.columns[1:],axis=1)

   name
0   홍길동
1   마징가
2  원더우면

In [33]:
dataDF.columns[1:]

Index(['job', 'gender', 'age', 'height'], dtype='object')

In [34]:
dataDF.drop(columns=dataDF.columns[::2])

  job  age
0  의적  100
1  로봇  200
2  영웅  300